Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.ai.privacy.notice
source: Starcat does not relay AI requests through any of our servers. Summaries, tag suggestions and semantic search send the minimum repository metadata / README excerpt directly to your selected provider.
ar: لا يقوم Starcat بتمرير طلبات الذكاء الاصطناعي عبر أي من خوادمنا. الملخصات واقتراحات العلامات والبحث الدلالي ترسل الحد الأدنى من بيانات المستودع / مقتطف README مباشرة إلى مزود الخدمة الذي اخترته.
de: Starcat leitet KI-Anfragen nicht über unsere Server weiter. Zusammenfassungen, Tag-Vorschläge und semantische Suche senden die minimalen Repository-Metadaten/README-Auszüge direkt an Ihren ausgewählten Anbieter.
es: Starcat no retransmite solicitudes de IA a través de ninguno de nuestros servidores. Los resúmenes, las sugerencias de etiquetas y la búsqueda semántica envían los metadatos mínimos del repositorio / un extracto del README directamente a tu proveedor seleccionado.
fr: Starcat ne relaie pas les requêtes IA via ses serveurs. Les résumés, suggestions d'étiquettes et la recherche sémantique envoient directement les métadonnées minimales du dépôt / un extrait du README à votre fournisseur choisi.
id: Starcat tidak meneruskan permintaan AI melalui server kami. Ringkasan, saran tag, dan pencarian semantik mengirim metadata repositori minimal / kutipan README langsung ke penyedia yang Anda pilih.
it: Starcat non inoltra richieste AI attraverso i nostri server. Riepiloghi, suggerimenti di tag e ricerca semantica inviano i metadati minimi del repository / estratto README direttamente al provider selezionato.
ja: StarcatはAIリクエストを自社サーバーを経由して中継しません。要約、タグ提案、セマンティック検索は、最小限のリポジトリメタデータ/README抜粋を選択したプロバイダに直接送信します。
ko: Starcat은 당사 서버를 통해 AI 요청을 중계하지 않습니다. 요약, 태그 제안 및 의미 검색은 최소한의 저장소 메타데이터/README 발췌문을 선택한 제공업체에 직접 전송합니다.
nl: Starcat stuurt AI-verzoeken niet via onze servers. Samenvattingen, tag-suggesties en semantisch zoeken sturen minimale repository-metadata/README-fragmenten rechtstreeks naar uw geselecteerde provider.
pl: Starcat nie przekazuje żądań AI przez swoje serwery. Podsumowania, sugestie tagów i wyszukiwanie semantyczne wysyłają minimalne metadane repozytorium / fragment README bezpośrednio do wybranego dostawcy.
pt_br: O Starcat não retransmite solicitações de IA por nenhum de nossos servidores. Resumos, sugestões de tags e busca semântica enviam o mínimo de metadados do repositório / trecho do README diretamente ao provedor selecionado.
ru: Starcat не передаёт AI-запросы через свои серверы. Сводки, предложения тегов и семантический поиск отправляют минимальные метаданные репозитория / выдержку из README напрямую выбранному провайдеру.
tr: Starcat, AI isteklerini kendi sunucuları üzerinden iletmez. Özetler, etiket önerileri ve anlamsal arama, minimum depo meta verilerini / README alıntısını doğrudan seçtiğiniz sağlayıcıya gönderir.
uk: Starcat не передає AI-запити через власні сервери. Підсумки, пропозиції тегів та семантичний пошук надсилають мінімальні метадані репозиторію / фрагмент README безпосередньо вашому обраному провайдеру.
vi: Starcat không chuyển tiếp yêu cầu AI qua bất kỳ máy chủ nào của chúng tôi. Tóm tắt, gợi ý thẻ và tìm kiếm ngữ nghĩa chỉ gửi siêu dữ liệu kho lưu trữ tối thiểu / đoạn trích README trực tiếp đến nhà cung cấp bạn đã chọn.
zh_hans: Starcat 不经过自建服务器转发 AI 请求。摘要、推荐标签和语义搜索会把必要的仓库元数据 / README 摘要发送给你选择的 Provider。
zh_hant: Starcat 不會透過任何自有伺服器轉發 AI 請求。摘要、標籤建議與語義搜尋會將最少的儲存庫中繼資料/README 摘要直接傳送至你選擇的 Provider。

# settings.ai.privacy.section
source: Privacy
ar: الخصوصية
de: Datenschutz
es: Privacidad
fr: Confidentialité
id: Privasi
ja: プライバシー
ko: 개인정보 보호
pl: Prywatność
pt_br: Privacidade
ru: Конфиденциальность
tr: Gizlilik
uk: Конфіденційність
vi: Quyền riêng tư
zh_hans: 隐私
zh_hant: 隱私權

# settings.ai.prompt.placeholder.body
source: Main body (fallback: AI summary → README plain text → description + topics).
ar: النص الرئيسي (البديل: ملخص AI → نص README العادي → الوصف + الموضوعات).
de: Haupttext (Fallback: KI-Zusammenfassung → README-Klartext → Beschreibung + Themen).
es: Cuerpo principal (fallback: resumen de IA → texto plano del README → descripción + temas).
fr: Corps principal (par défaut : résumé IA → texte brut du README → description + sujets).
id: Badan utama (cadangan: ringkasan AI → teks biasa README → deskripsi + topik).
it: Corpo principale (fallback: riepilogo AI → testo semplice README → descrizione + argomenti).
ja: 本文（フォールバック: AI要約 → READMEプレーンテキスト → 説明＋トピック）。
ko: 본문 (대체: AI 요약 → README 일반 텍스트 → 설명 + 주제).
nl: Hoofdtekst (terugval: AI-samenvatting → README-platte tekst → beschrijving + onderwerpen).
pl: Główna treść (domyślnie: podsumowanie AI → zwykły tekst README → opis + tematy).
pt_br: Corpo principal (fallback: resumo IA → texto simples do README → descrição + tópicos).
ru: Основной текст (запасной вариант: AI-сводка → обычный текст README → описание + темы).
tr: Ana gövde (yedek: AI özeti → README düz metni → açıklama + konular).
uk: Основний текст (запасний варіант: AI-підсумок → звичайний текст README → опис + теми).
vi: Nội dung chính (dự phòng: tóm tắt AI → văn bản thuần README → mô tả + chủ đề).
zh_hans: 主体内容（三级降级：AI 摘要 > README 纯文本 > description + topics 兜底）。
zh_hant: 主體內容（三級降級：AI 摘要 > README 純文字 > description + topics 兜底）。

# settings.ai.prompt.placeholder.codeContext
source: Code context XML from RepoContextPacker (empty when disabled or fetch fails).
ar: سياق الكود XML من RepoContextPacker (فارغ عند التعطيل أو فشل الجلب).
de: Code-Kontext-XML von RepoContextPacker (leer, wenn deaktiviert oder Abruf fehlschlägt).
es: XML de contexto de código de RepoContextPacker (vacío cuando está desactivado o falla la obtención).
fr: XML du contexte de code provenant de RepoContextPacker (vide si désactivé ou si la récupération échoue).
id: XML konteks kode dari RepoContextPacker (kosong saat dinonaktifkan atau gagal mengambil).
it: XML del contesto del codice da RepoContextPacker (vuoto quando disabilitato o il recupero fallisce).
ja: RepoContextPackerからのコードコンテキストXML（無効または取得失敗時は空）。
ko: RepoContextPacker의 코드 컨텍스트 XML (비활성화 또는 가져오기 실패 시 비어 있음).
nl: Codecontext-XML van RepoContextPacker (leeg indien uitgeschakeld of ophalen mislukt).
pl: Kod kontekstowy XML z RepoContextPacker (pusty, gdy wyłączony lub pobieranie nie powiedzie się).
pt_br: XML de contexto de código do RepoContextPacker (vazio quando desativado ou a busca falha).
ru: XML контекста кода из RepoContextPacker (пусто, если отключено или не удалось получить).
tr: RepoContextPacker'dan kod bağlamı XML'si (devre dışıyken veya getirme başarısız olduğunda boş).
uk: XML контексту коду з RepoContextPacker (порожній, якщо вимкнено або помилка отримання).
vi: XML ngữ cảnh mã từ RepoContextPacker (trống khi bị vô hiệu hóa hoặc tìm nạp thất bại).
zh_hans: RepoContextPacker 生成的代码上下文 XML（关闭或拉取失败时为空）。
zh_hant: RepoContextPacker 產生的程式碼上下文 XML（關閉或擷取失敗時為空）。

# settings.ai.prompt.placeholder.description
source: Repository description.
ar: وصف المستودع.
de: Repository-Beschreibung.
es: Descripción del repositorio.
fr: Description du dépôt.
id: Deskripsi repositori.
it: Descrizione del repository.
ja: リポジトリの説明。
ko: 저장소 설명.
nl: Repository-beschrijving.
pl: Opis repozytorium.
pt_br: Descrição do repositório.
ru: Описание репозитория.
tr: Depo açıklaması.
uk: Опис репозиторію.
vi: Mô tả kho lưu trữ.
zh_hans: 仓库描述。
zh_hant: 儲存庫描述。

# settings.ai.prompt.placeholder.externalContext
source: External Search markdown (wrapped in <external_context trust="untrusted">; empty when disabled or fetch fails).
ar: سياق البحث الخارجي بصيغة markdown (مغلف بـ <external_context trust="untrusted">؛ فارغ عند التعطيل أو فشل الجلب).
de: Externes Such-Markdown (eingeschlossen in <external_context trust="untrusted">; leer, wenn deaktiviert oder Abruf fehlschlägt).
es: Markdown de búsqueda externa (envuelto en <external_context trust="untrusted">; vacío cuando está desactivado o falla la obtención).
fr: Markdown de recherche externe (encadré par <external_context trust="untrusted"> ; vide si désactivé ou si la récupération échoue).
id: Markdown Pencarian Eksternal (dibungkus dalam <external_context trust="untrusted">; kosong saat dinonaktifkan atau gagal mengambil).
it: Markdown di ricerca esterna (racchiuso in <external_context trust="untrusted">; vuoto quando disabilitato o il recupero fallisce).
ja: 外部検索マークダウン（<external_context trust="untrusted">でラップ。無効または取得失敗時は空）。
ko: 외부 검색 마크다운 (<external_context trust="untrusted">로 감싸짐; 비활성화 또는 가져오기 실패 시 비어 있음).
nl: Externe zoekopdracht in markdown (verpakt in <external_context trust="untrusted">; leeg indien uitgeschakeld of ophalen mislukt).
pl: Zewnętrzny kontekst wyszukiwania w formacie Markdown (owinięty w <external_context trust="untrusted">; pusty, gdy wyłączony lub pobieranie nie powiedzie się).
pt_br: Markdown de busca externa (envolvido em <external_context trust="untrusted">; vazio quando desativado ou a busca falha).
ru: Внешний поиск в формате Markdown (обёрнут в <external_context trust="untrusted">; пусто, если отключено или не удалось получить).
tr: Harici Arama işaretleme dili (<external_context trust="untrusted"> içinde; devre dışıyken veya getirme başarısız olduğunda boş).
uk: Markdown зовнішнього пошуку (обгорнутий у <external_context trust="untrusted">; порожній, якщо вимкнено або помилка отримання).
vi: Markdown tìm kiếm bên ngoài (được bọc trong <external_context trust="untrusted">; trống khi bị vô hiệu hóa hoặc tìm nạp thất bại).
zh_hans: External Search 生成的外部网页检索 markdown（已含 <external_context trust="untrusted"> 包裹；关闭或拉取失败时为空）。
zh_hant: External Search 產生的外部網頁搜尋 Markdown（已包含 <external_context trust="untrusted"> 包裹；關閉或擷取失敗時為空）。

# settings.ai.prompt.placeholder.fullName
source: owner/name
ar: مالك/اسم
es: propietario/nombre
fr: propriétaire/nom
id: pemilik/nama
it: proprietario/nome
ko: 소유자/이름
nl: eigenaar/naam
pl: właściciel/nazwa
pt_br: proprietário/nome
ru: владелец/имя
tr: sahip/ad
uk: власник/назва
vi: chủ_sở_hữu/tên

# settings.ai.prompt.placeholder.homepage
source: Homepage URL.
ar: عنوان URL للصفحة الرئيسية.
es: URL de la página de inicio.
fr: URL de la page d'accueil.
id: URL halaman beranda.
it: URL della homepage.
ja: ホームページURL。
ko: 홈페이지 URL.
pl: URL strony domowej.
pt_br: URL da página inicial.
ru: URL домашней страницы.
tr: Ana sayfa URL'si.
uk: URL домашньої сторінки.
vi: URL trang chủ.
zh_hans: 主页 URL。
zh_hant: 首頁 URL。

# settings.ai.prompt.placeholder.language
source: Primary language.
ar: اللغة الأساسية.
de: Primäre Sprache.
es: Lenguaje principal.
fr: Langage principal.
id: Bahasa utama.
it: Linguaggio principale.
ja: 主要言語。
ko: 주요 언어.
nl: Primaire programmeertaal.
pl: Główny język.
pt_br: Linguagem principal.
ru: Основной язык.
tr: Birincil dil.
uk: Основна мова.
vi: Ngôn ngữ chính.
zh_hans: 主语言。
zh_hant: 主要語言。

# settings.ai.prompt.placeholder.libraryTags
source: Top-30 frequently used tags from your library (comma-separated).
ar: أعلى 30 علامة مستخدمة بشكل متكرر من مكتبتك (مفصولة بفواصل).
de: Top-30 häufig verwendete Tags aus Ihrer Bibliothek (kommagetrennt).
es: Las 30 etiquetas más usadas de tu biblioteca (separadas por comas).
fr: 30 étiquettes les plus fréquentes de votre bibliothèque (séparées par des virgules).
id: 30 tag teratas yang sering digunakan dari perpustakaan Anda (dipisahkan koma).
it: Top-30 tag usati frequentemente dalla tua libreria (separati da virgola).
ja: ライブラリでよく使われるタグ上位30個（カンマ区切り）。
ko: 라이브러리에서 가장 자주 사용되는 상위 30개 태그 (쉼표로 구분).
nl: Top-30 veelgebruikte tags uit uw bibliotheek (komma-gescheiden).
pl: 30 najczęściej używanych tagów z twojej biblioteki (oddzielonych przecinkami).
pt_br: As 30 tags mais usadas da sua biblioteca (separadas por vírgula).
ru: Топ-30 часто используемых тегов из вашей библиотеки (через запятую).
tr: Kitaplığınızdan en sık kullanılan 30 etiket (virgülle ayrılmış).
uk: 30 найчастіше використовуваних тегів з вашої бібліотеки (через кому).
vi: 30 thẻ được sử dụng thường xuyên nhất từ thư viện của bạn (phân cách bằng dấu phẩy).
zh_hans: 标签库高频前 30 个（逗号分隔）。
zh_hant: 你的標籤庫中前 30 個常用標籤（逗號分隔）。

# settings.ai.prompt.placeholder.license
source: SPDX license identifier.
ar: معرف ترخيص SPDX.
de: SPDX-Lizenzkennung.
es: Identificador de licencia SPDX.
fr: Identifiant de licence SPDX.
id: Pengidentifikasi lisensi SPDX.
it: Identificatore SPDX della licenza.
ja: SPDXライセンス識別子。
ko: SPDX 라이선스 식별자.
nl: SPDX-licentie-ID.
pl: Identyfikator licencji SPDX.
pt_br: Identificador de licença SPDX.
ru: Идентификатор лицензии SPDX.
tr: SPDX lisans tanımlayıcısı.
uk: Ідентифікатор ліцензії SPDX.
vi: Mã định danh giấy phép SPDX.
zh_hans: SPDX 许可证标识。
zh_hant: SPDX 授權條款識別碼。

# settings.ai.prompt.placeholder.metadata
source: Repository metadata block (fullName / description / language / topics / license / stars / forks / homepage).
ar: كتلة بيانات المستودع (الاسم الكامل / الوصف / اللغة / الموضوعات / الترخيص / النجوم / الشوكات / الصفحة الرئيسية).
de: Repository-Metadatenblock (fullName / description / language / topics / license / stars / forks / homepage).
es: Bloque de metadatos del repositorio (fullName / description / language / topics / license / stars / forks / homepage).
fr: Bloc de métadonnées du dépôt (fullName / description / language / topics / license / stars / forks / homepage).
id: Blok metadata repositori (fullName / description / language / topics / license / stars / forks / homepage).
it: Blocco metadati del repository (fullName / description / language / topics / license / stars / forks / homepage).
ja: リポジトリメタデータブロック（fullName / description / language / topics / license / stars / forks / homepage）。
ko: 저장소 메타데이터 블록 (fullName / description / language / topics / license / stars / forks / homepage).
nl: Repository-metadatablok (fullName / description / language / topics / license / stars / forks / homepage).
pl: Blok metadanych repozytorium (fullName / description / language / topics / license / stars / forks / homepage).
pt_br: Bloco de metadados do repositório (nome completo / descrição / linguagem / tópicos / licença / estrelas / forks / página inicial).
ru: Блок метаданных репозитория (fullName / description / language / topics / license / stars / forks / homepage).
tr: Depo meta veri bloğu (fullName / description / language / topics / license / stars / forks / homepage).
uk: Блок метаданих репозиторію (fullName / description / language / topics / license / stars / forks / homepage).
vi: Khối siêu dữ liệu kho lưu trữ (fullName / description / language / topics / license / stars / forks / homepage).
zh_hans: 仓库元数据块（fullName / description / language / topics / license / stars / forks / homepage）。
zh_hant: 儲存庫中繼資料區塊（fullName / description / language / topics / license / stars / forks / homepage）。

# settings.ai.prompt.placeholder.notes
source: Your private note.
ar: ملاحظتك الخاصة.
de: Ihre private Notiz.
es: Tu nota privada.
fr: Votre note privée.
id: Catatan pribadi Anda.
it: La tua nota privata.
ja: あなたのプライベートノート。
ko: 개인 메모.
nl: Uw privénotitie.
pl: Twoja prywatna notatka.
pt_br: Sua nota privada.
ru: Ваша личная заметка.
tr: Özel notunuz.
uk: Ваша приватна нотатка.
vi: Ghi chú riêng tư của bạn.
zh_hans: 用户私有笔记。
zh_hant: 你的私人筆記。

# settings.ai.prompt.placeholder.outputLanguage.chat
source: Output language (follows Settings → Language). Drives reply language and the fallback sentence when context is insufficient.
ar: لغة الإخراج (تتبع الإعدادات → اللغة). تحدد لغة الرد والجملة الاحتياطية عندما يكون السياق غير كافٍ.
de: Ausgabesprache (folgt Einstellungen → Sprache). Steuert die Antwortsprache und den Standardsatz bei unzureichendem Kontext.
es: Idioma de salida (sigue Ajustes → Idioma). Determina el idioma de la respuesta y la frase de respaldo cuando el contexto es insuficiente.
fr: Langue de sortie (suit Réglages → Langue). Détermine la langue de la réponse et la phrase de repli lorsque le contexte est insuffisant.
id: Bahasa keluaran (mengikuti Pengaturan → Bahasa). Mengarahkan bahasa balasan dan kalimat cadangan saat konteks tidak mencukupi.
it: Lingua di output (segue Impostazioni → Lingua). Guida la lingua della risposta e la frase di fallback quando il contesto è insufficiente.
ja: 出力言語（設定→言語に従う）。応答の言語と、コンテキストが不十分な場合のフォールバック文を制御します。
ko: 출력 언어 (설정 → 언어를 따름). 답변 언어와 컨텍스트가 부족할 때의 대체 문장을 결정합니다.
nl: Uitvoertaal (volgt Instellingen → Taal). Bepaalt antwoordtaal en de terugvalzin wanneer context onvoldoende is.
pl: Język wyjściowy (zgodny z Ustawienia → Język). Określa język odpowiedzi oraz domyślne zdanie, gdy kontekst jest niewystarczający.
pt_br: Idioma de saída (segue Ajustes → Idioma). Determina o idioma da resposta e a frase de fallback quando o contexto é insuficiente.
ru: Язык вывода (следует за Настройки → Язык). Определяет язык ответа и запасное предложение, когда контекста недостаточно.
tr: Çıktı dili (Ayarlar → Dil'i takip eder). Yanıt dilini ve bağlam yetersiz olduğunda yedek cümleyi yönlendirir.
uk: Мова виводу (відповідає Налаштуванням → Мова). Визначає мову відповіді та резервне речення, коли контексту недостатньо.
vi: Ngôn ngữ đầu ra (theo Cài đặt → Ngôn ngữ). Điều khiển ngôn ngữ trả lời và câu dự phòng khi ngữ cảnh không đủ.
zh_hans: 输出语言（跟随设置 → 语言）；同时驱动正文语言和上下文不足时的兜底句自然翻译。
zh_hant: 輸出語言（跟隨設定 → 語言）。驅動回覆語言以及上下文不足時的備用句子。

# settings.ai.prompt.placeholder.outputLanguage.summary
source: Output language (follows Settings → Language; e.g. Simplified Chinese / English / Japanese). Drives body language and section titles.
ar: لغة الإخراج (تتبع الإعدادات → اللغة؛ مثل الصينية المبسطة / الإنجليزية / اليابانية). تحدد لغة النص وعناوين الأقسام.
de: Ausgabesprache (folgt Einstellungen → Sprache; z. B. Vereinfachtes Chinesisch / Englisch / Japanisch). Steuert Textsprache und Abschnittstitel.
es: Idioma de salida (sigue Ajustes → Idioma; p. ej., Chino simplificado / Inglés / Japonés). Determina el idioma del cuerpo y los títulos de las secciones.
fr: Langue de sortie (suit Réglages → Langue ; ex. : chinois simplifié / anglais / japonais). Détermine la langue du corps et les titres des sections.
id: Bahasa keluaran (mengikuti Pengaturan → Bahasa; mis. Tionghoa Sederhana / Inggris / Jepang). Mengarahkan bahasa badan dan judul bagian.
it: Lingua di output (segue Impostazioni → Lingua; es. Cinese semplificato / Inglese / Giapponese). Guida la lingua del corpo e i titoli delle sezioni.
ja: 出力言語（設定→言語に従う。例: 簡体字中国語/英語/日本語）。本文の言語とセクションタイトルを制御します。
ko: 출력 언어 (설정 → 언어를 따름, 예: 중국어 간체/영어/일본어). 본문 언어와 섹션 제목을 결정합니다.
nl: Uitvoertaal (volgt Instellingen → Taal; bijv. Vereenvoudigd Chinees / Engels / Japans). Bepaalt lichaamstaal en sectietitels.
pl: Język wyjściowy (zgodny z Ustawienia → Język; np. chiński uproszczony / angielski / japoński). Określa język treści i tytuły sekcji.
pt_br: Idioma de saída (segue Ajustes → Idioma; ex.: Chinês Simplificado / Inglês / Japonês). Determina o idioma do corpo e os títulos das seções.
ru: Язык вывода (следует за Настройки → Язык; например, упрощённый китайский / английский / японский). Определяет язык тела и заголовки разделов.
tr: Çıktı dili (Ayarlar → Dil'i takip eder; örn. Basitleştirilmiş Çince / İngilizce / Japonca). Gövde dilini ve bölüm başlıklarını yönlendirir.
uk: Мова виводу (відповідає Налаштуванням → Мова; напр. спрощена китайська / англійська / японська). Визначає мову тексту та заголовки розділів.
vi: Ngôn ngữ đầu ra (theo Cài đặt → Ngôn ngữ; ví dụ: Tiếng Trung Giản thể / Tiếng Anh / Tiếng Nhật). Điều khiển ngôn ngữ nội dung và tiêu đề phần.
zh_hans: 输出语言（跟随设置 → 语言，如 Simplified Chinese / English / Japanese）；同时驱动正文语言和章节标题语言。
zh_hant: 輸出語言（跟隨設定 → 語言，例如繁體中文 / 英文 / 日文）。驅動主體語言與章節標題。

# settings.ai.prompt.placeholder.outputLanguage.tags
source: Output language (follows Settings → Language; e.g. Simplified Chinese / English / Japanese).
ar: لغة الإخراج (تتبع الإعدادات → اللغة؛ مثل الصينية المبسطة / الإنجليزية / اليابانية).
de: Ausgabesprache (folgt Einstellungen → Sprache; z. B. Vereinfachtes Chinesisch / Englisch / Japanisch).
es: Idioma de salida (sigue Ajustes → Idioma; p. ej., Chino simplificado / Inglés / Japonés).
fr: Langue de sortie (suit Réglages → Langue ; ex. : chinois simplifié / anglais / japonais).
id: Bahasa keluaran (mengikuti Pengaturan → Bahasa; mis. Tionghoa Sederhana / Inggris / Jepang).
it: Lingua di output (segue Impostazioni → Lingua; es. Cinese semplificato / Inglese / Giapponese).
ja: 出力言語（設定→言語に従う。例: 簡体字中国語/英語/日本語）。
ko: 출력 언어 (설정 → 언어를 따름, 예: 중국어 간체/영어/일본어).
nl: Uitvoertaal (volgt Instellingen → Taal; bijv. Vereenvoudigd Chinees / Engels / Japans).
pl: Język wyjściowy (zgodny z Ustawienia → Język; np. chiński uproszczony / angielski / japoński).
pt_br: Idioma de saída (segue Ajustes → Idioma; ex.: Chinês Simplificado / Inglês / Japonês).
ru: Язык вывода (следует за Настройки → Язык; например, упрощённый китайский / английский / японский).
tr: Çıktı dili (Ayarlar → Dil'i takip eder; örn. Basitleştirilmiş Çince / İngilizce / Japonca).
uk: Мова виводу (відповідає Налаштуванням → Мова; напр. спрощена китайська / англійська / японська).
vi: Ngôn ngữ đầu ra (theo Cài đặt → Ngôn ngữ; ví dụ: Tiếng Trung Giản thể / Tiếng Anh / Tiếng Nhật).
zh_hans: 输出语言（跟随设置 → 语言，如 Simplified Chinese / English / Japanese）。
zh_hant: 輸出語言（跟隨設定 → 語言，例如繁體中文 / 英文 / 日文）。

# settings.ai.prompt.placeholder.readme
source: Cleaned and truncated README plain text.
ar: نص README العادي المنظف والمقتطع.
de: Bereinigter und gekürzter README-Klartext.
es: Texto plano del README limpiado y truncado.
fr: Texte brut du README nettoyé et tronqué.
id: Teks biasa README yang dibersihkan dan dipotong.
it: Testo semplice README pulito e troncato.
ja: クリーニングおよび切り詰められたREADMEプレーンテキスト。
ko: 정리되고 잘린 README 일반 텍스트.
nl: Opgeschoonde en ingekorte README-platte tekst.
pl: Oczyszczony i skrócony zwykły tekst README.
pt_br: Texto simples do README limpo e truncado.
ru: Очищенный и сокращённый обычный текст README.
tr: Temizlenmiş ve kısaltılmış README düz metni.
uk: Очищений та скорочений звичайний текст README.
vi: Văn bản thuần README đã được làm sạch và cắt ngắn.
zh_hans: 清洗 + 截断后的 README 纯文本。
zh_hant: 清理並截斷後的 README 純文字。

# settings.ai.prompt.placeholder.readmeHTML
source: Source README HTML fragment from GitHub’s HTML render endpoint (User Prompt only).
ar: جزء HTML المصدر لـ README من نقطة نهاية عرض HTML في GitHub (موجه المستخدم فقط).
de: Quell-README-HTML-Fragment vom GitHub-HTML-Rendering-Endpunkt (nur Benutzer-Prompt).
es: Fragmento HTML del README fuente desde el endpoint de renderizado HTML de GitHub (solo para Prompt de Usuario).
fr: Fragment HTML du README source provenant du point de terminaison de rendu HTML de GitHub (prompt utilisateur uniquement).
id: Fragmen HTML README sumber dari titik akhir render GitHub (hanya Prompt Pengguna).
it: Frammento HTML del README sorgente dall'endpoint di rendering HTML di GitHub (solo Prompt Utente).
ja: GitHubのHTMLレンダリングエンドポイントからのソースREADME HTML断片（ユーザープロンプトのみ）。
ko: GitHub HTML 렌더 엔드포인트의 소스 README HTML 조각 (사용자 프롬프트 전용).
nl: Bron-README HTML-fragment van GitHub's HTML-rendering-eindpunt (alleen gebruikersprompt).
pl: Fragment HTML README z punktu końcowego renderowania HTML GitHub (tylko Prompt użytkownika).
pt_br: Fragmento HTML do README de origem do endpoint de renderização HTML do GitHub (apenas Prompt do Usuário).
ru: Фрагмент HTML исходного README из конечной точки HTML-рендеринга GitHub (только для пользовательского запроса).
tr: GitHub'ın HTML oluşturma uç noktasından kaynak README HTML parçası (yalnızca Kullanıcı İstemi).
uk: Фрагмент HTML README з GitHub HTML render endpoint (лише для User Prompt).
vi: Đoạn HTML README nguồn từ điểm cuối kết xuất HTML của GitHub (chỉ dành cho User Prompt).
zh_hans: 源 README HTML 片段（GitHub HTML render 端点产物；只能用于 User Prompt）。
zh_hant: 來自 GitHub HTML 渲染端點的原始 README HTML 片段（僅限使用者提示）。
